In [1]:
import ibm_db

In [2]:
#Replace the placeholder values with your actual Db2 hostname, username, and password:
dsn_hostname = "dashdb-txn-sbox-yp-lon02-07.services.eu-gb.bluemix.net" 
dsn_uid = "qmm86575"
dsn_pwd = "b1t+qf9vsl0h444j"

dsn_driver = "{IBM DB2 ODBC DRIVER}"
dsn_database = "BLUDB"
dsn_port = "50000"
dsn_protocol = "TCPIP"

In [ ]:
dsn = (
    "DRIVER={0};"
    "DATABASE={1};"
    "HOSTNAME={2};"
    "PORT={3};"
    "PROTOCOL={4};"
    "UID={5};"
    "PWD={6};").format(dsn_driver, dsn_database, dsn_hostname, dsn_port, dsn_protocol, dsn_uid, dsn_pwd)

try:
    conn = ibm_db.connect(dsn, "", "")
    print ("Connected to database: ", dsn_database, "as user: ", dsn_uid, "on host: ", dsn_hostname)

except:
    print ("Unable to connect: ", ibm_db.conn_errormsg() )

In [4]:
dropQuery = 'drop table INSTRUCTOR'

drpStmt = ibm_db.exec_immediate(conn,dropQuery )

In [5]:
createQuery = 'create table INSTRUCTOR(ID INTEGER PRIMARY KEY NOT NULL, FNAME VARCHAR(20), LNAME VARCHAR(20), CITY VARCHAR(20), CCODE CHAR(2))'

crtStmt = ibm_db.exec_immediate(conn, createQuery)

In [6]:
insertQuery = "insert into INSTRUCTOR values (1, 'Siva', 'Kumar', 'Bangalore', 'IN')"

instStmt = ibm_db.exec_immediate(conn, insertQuery)

In [7]:
insertQuery2 = "insert into INSTRUCTOR values (2, 'Pabbi', 'Setty', 'Bangalore', 'IN')"

instStmt = ibm_db.exec_immediate(conn, insertQuery2)

In [8]:
insertQuery3 = "insert into INSTRUCTOR values (3, 'Si', 'Ku', 'Bangalore', 'IN')"

instStmt = ibm_db.exec_immediate(conn, insertQuery3)

In [9]:
selectQuery = "select * from INSTRUCTOR"

selectStmt = ibm_db.exec_immediate(conn, selectQuery)

ibm_db.fetch_both(selectStmt)

{'ID': 1,
 0: 1,
 'FNAME': 'Siva',
 1: 'Siva',
 'LNAME': 'Kumar',
 2: 'Kumar',
 'CITY': 'Bangalore',
 3: 'Bangalore',
 'CCODE': 'IN',
 4: 'IN'}

In [10]:
while ibm_db.fetch_row(selectStmt) != False:
   print (" ID:",  ibm_db.result(selectStmt, 0), " FNAME:",  ibm_db.result(selectStmt, "FNAME"))

 ID: 2  FNAME: Pabbi
 ID: 3  FNAME: Si

In [13]:
import pandas
import ibm_db_dbi

In [14]:
pconn = ibm_db_dbi.Connection(conn)

In [15]:
selectQuery = "select * from INSTRUCTOR"

pd = pandas.read_sql(selectQuery, pconn)

In [17]:
pd.LNAME[0]

'Kumar'

In [20]:
pd

   ID  FNAME  LNAME       CITY CCODE
0   1   Siva  Kumar  Bangalore    IN
1   2  Pabbi  Setty  Bangalore    IN
2   3     Si     Ku  Bangalore    IN

In [21]:
pd.shape

(3, 5)

ibm_db.close(conn)